amitandgithub/STM32F1xx_CPP_FW/STM32F1xx_CPP_FW - CPF_old/HAL/I2C/I2c.h
        void Disable_EVT_Interrupt(){CLEAR_BIT(m_I2Cx->CR2, I2C_CR2_ITEVTEN);}
        
        void Disable_BUF_Interrupt(){CLEAR_BIT(m_I2Cx->CR2, I2C_CR2_ITBUFEN);}
        
        void Disable_ERR_Interrupt(){CLEAR_BIT(m_I2Cx->CR2, I2C_CR2_ITERREN);}
        
        void Disable_EVT_BUF_ERR_Interrupt(){CLEAR_BIT(m_I2Cx->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);}
        
        void Disable_EVT_ERR_Interrupt(){CLEAR_BIT(m_I2Cx->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN);}
        
        inline I2CStatus_t StartListening();
        
        inline bool StopFlagCleared(uint32_t timeout);
        
		void I2C1_DMA_Tx_Done_Handler();
        
		void I2C1_DMA_Rx_Done_Handler();
#if I2C_DMA
        class I2C1_DMA_Rx_Callback : public Callback
        {
        public:
            I2C1_DMA_Rx_Callback(I2c* This):_This(This){};
            virtual void CallbackFunction();
        private:
            I2c* _This;
        };
        
        class I2C1_DMA_Tx_Callback : public Callback
        {
        public:
            I2C1_DMA_Tx_Callback(I2c* This):_This(This){};
            virtual void CallbackFunction();
        private:
            I2c* _This;
        };
        
        class I2C2_DMA_Rx_Callback : public Callback
        {
        public:
            I2C2_DMA_Rx_Callback(I2c* This):_This(This){};
            virtual void CallbackFunction();
        private:
            I2c* _This;
        };
        
        class I2C2_DMA_Tx_Callback : public Callback
        {
        public:
            I2C2_DMA_Tx_Callback(I2c* This):_This(This){};
            virtual void CallbackFunction();
        private:
            I2c* _This;
        };
#endif  
        inline void LogStates(I2CLogs_t log);
    private:
        GpioOutput              m_sclPin;
        GpioOutput              m_sdaPin;
        Hz_t                    m_hz;
        I2Cx_t                  m_I2Cx;            
        Transaction_t           m_Transaction;
        I2CCallback_t           m_TxQueueEmptyCallback;
        I2CCallback_t           m_RxQueueFullCallback;
        I2CCallback_t           m_SlaveTxDoneCallback;
        I2CCallback_t           m_SlaveRxDoneCallback;
        I2CTxnQueue_t           m_I2CTxnQueue;
        
        /* It must be volatile becoz it is shared between ISR and main loop */
        volatile I2CState_t     m_I2CState; 
        /* It must be volatile becoz it is shared between ISR and main loop */
        volatile I2CStatus_t    m_I2CStatus;
        
#if I2C_DMA
        I2C1_DMA_Rx_Callback m_I2C1_DMA_Rx_Callback;
        I2C1_DMA_Tx_Callback m_I2C1_DMA_Tx_Callback;
        I2C2_DMA_Rx_Callback m_I2C2_DMA_Rx_Callback;
        I2C2_DMA_Tx_Callback m_I2C2_DMA_Tx_Callback;
        HAL::DMA*            m_DMAx;
#endif
        
    public:         
#ifdef I2C_DEBUG
        I2CLogs_t       I2CStates[I2C_LOG_STATES_SIZE];
        volatile uint32_t        I2CStates_Idx;
        Utils::DebugLog<DBG_LOG_TYPE>* dbg_log_instance;
#endif
        
    public:      
        I2CSlaveRxQueue_t   m_I2CSlaveRxQueue;
        I2CSlaveTxQueue_t   m_I2CSlaveTxQueue; 
    };   
    
    
    inline void I2c::SetRxFullCallback(I2CCallback_t I2CCallback)
    {
        m_RxQueueFullCallback = I2CCallback;
    }
    
    inline uint8_t I2c::ReadRxData()
    {
        uint8_t Data;
        m_I2CSlaveRxQueue.Read(Data);
        return Data;
    }
    
    bool I2c::StartConditionGenerated(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_SB(m_I2Cx) == 0U) );
        return (bool)LL_I2C_IsActiveFlag_SB(m_I2Cx);
    }
    
    inline uint8_t I2c::SlaveRxDataAvailable()
    {
        return m_I2CSlaveRxQueue.Available();
    }
    
    bool I2c::Busy(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_BUSY(m_I2Cx) == 1U) );
        return (bool)LL_I2C_IsActiveFlag_BUSY(m_I2Cx);
    }
    
    bool I2c::StopFlagCleared(uint32_t timeout)
    {   
#if 1
        static int StopCountMax;
        uint32_t Timeout=0;
        
        while( (timeout--) && (m_I2Cx->CR1 & (I2C_CR1_STOP)) )
        {            
            Timeout++;          
        }
        
        if(StopCountMax<Timeout) 
            StopCountMax = Timeout;
#else
        while( (timeout--) && (m_I2Cx->CR1 & (I2C_CR1_STOP)) );        
#endif
        return (bool)(m_I2Cx->CR1 & (I2C_CR1_STOP));
    }
    
    
    bool I2c::SlaveAddressSent(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_ADDR(m_I2Cx) == 0U) );
        return (bool)LL_I2C_IsActiveFlag_ADDR(m_I2Cx);
    } 
    bool I2c::TransmitterEmpty(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_TXE(m_I2Cx) == 0U) );
        return (bool)LL_I2C_IsActiveFlag_TXE(m_I2Cx);
    }
    
    bool I2c::TransferDone(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_BTF(m_I2Cx) == 0U) );
        return (bool)LL_I2C_IsActiveFlag_BTF(m_I2Cx);
    }
    void I2c::SoftReset()
    {
        LL_I2C_EnableReset(m_I2Cx);
        LL_I2C_DisableReset(m_I2Cx);
        HwInit();
    }
    bool I2c::ACKFail(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_AF(m_I2Cx) == 1U) );
        return (bool)LL_I2C_IsActiveFlag_AF(m_I2Cx);
    }
    
    bool I2c::DataAvailableRXNE(uint32_t timeout)
    {
        while( (timeout--) && (LL_I2C_IsActiveFlag_RXNE(m_I2Cx) == 0U) );
        return (bool)LL_I2C_IsActiveFlag_RXNE(m_I2Cx);
    }
    
    I2c::I2CStatus_t I2c::StartListening()
    {
        /* Wait until BUSY flag is reset */
        if( Busy(I2C_TIMEOUT) == true ) 
        {          
            //I2C_DEBUG_LOG(I2C_BUSY_TIMEOUT);
            return I2C_BUSY_TIMEOUT;                
        }        
        /* Disable Pos */
        m_I2Cx->CR1 &= ~I2C_CR1_POS;
        
        /* Enable Address Acknowledge */
        m_I2Cx->CR1 |= I2C_CR1_ACK;
        
        // m_I2CState = SLAVE_RX_LISTENING;
        m_I2CState = READY;
        
        Enable_EVT_BUF_ERR_Interrupt();
        
        return I2C_OK;
    }
    
    I2c::I2CState_t I2c::GetState()
    {
        return m_I2CState;
    }
    
    
    
#if I2C_DEBUG     
#pragma inline = forced
    void I2c::LogStates(I2CLogs_t log)
    {
#if 1
        I2CStates[I2CStates_Idx++] = log;
        if(I2CStates_Idx == I2C_LOG_STATES_SIZE )
            I2CStates_Idx = 0;
#else
        dbg_log_instance->Log(log);
#endif
    }
    
    //#define I2C_LOG_STATES(log) (I2CStates[I2CStates_Idx++  % I2C_LOG_STATES_SIZE] = (log))
#define I2C_DEBUG_LOG(log) (m_I2CStatus = (log))  // 108 bytes of ROM
#define I2C_LOG_STATES(log) LogStates(log)
#define I2C_LOG_EVENTS(log) //LogStates(log)
    
#else
    
#define I2C_LOG_STATES(log)
#define I2C_DEBUG_LOG(log)
#define I2C_LOG_EVENTS(log)
    
#endif    
    
}
#endif //I2c_h
